app/controllers/users_controller.rb

  def zip_codes
    zip_code = params[:zipcode]
    age_range = params[:age_range].to_i
    address = "https://api.zip-codes.com/ZipCodesAPI.svc/1.0/FindZipCodesInRadius?zipcode=#{zip_code}&minimumradius=0&maximumradius=50&key=R4HL98UR5HDFPHED0FIQ"
    escaped_address = URI.escape(address)
    uri = URI.parse(escaped_address)
    json = Net::HTTP.get(uri)
    hash = eval(json)
    cities = []
    hash[:DataList].each{|obj| cities << obj[:City]}
    wf = Hash.new(0).tap { |h| cities.each { |word| h[word] += 1 } }.sort_by {|k,v| v}.reverse
    #taking the 50 biggest cities
    biggest_cities = wf[0..50]
    n_zips = 0
    biggest_cities.each{|city|
      n_zips += city[1]
    }
    n_members = 500.0
    proportions = n_members / n_zips
    hash_city = Hash.new
    biggest_cities.each{|city_arr|
      hash_city["#{city_arr[0]}"] = (city_arr[1] * proportions).to_i
    }
    random_user = []
    users_with_photos_prop = n_members * 0.65
    users_without_photos_prop = n_members * 0.35
    users_with_photos_arr = User.where.not(photos: []).order("RANDOM()")[0..users_with_photos_prop]
---
SELECT "users".* FROM "users" ORDER BY RANDOM()

        new_user = random_users[0]
        unless new_user == nil

          user = TemporaryList.create(city: key,
            figure: new_user.figure, ethnicity: new_user.ethnicity, occupation: new_user.occupation,
            description: new_user.description, age: new_user.age,
            marital_status: new_user.marital_status, anything_exciting: new_user.anything_exciting,
            long_term: new_user.long_term, open_anything: new_user.open_anything,
            short_term: new_user.short_term, undecided: new_user.undecided, virtual: new_user.virtual,
            height: new_user.height, hair_color: new_user.hair_color, eye_color: new_user.eye_color,
            smoker: new_user.smoker, anything_goes: new_user.anything_goes,
            dominated: new_user.dominated, dominate: new_user.dominate,
            normal: new_user.normal, threesome: new_user.threesome, secret: new_user.secret,
            active: new_user.active, shy: new_user.shy, sociable: new_user.sociable, fun: new_user.fun, generous: new_user.generous,
            relaxed: new_user.relaxed, moody: new_user.moody, modest: new_user.modest, sensitive: new_user.sensitive, photos: new_user.photos,
            username: new_user.username, independent: new_user.independent,
            mature: new_user.mature, outgoing: new_user.outgoing,
            self_confident: new_user.self_confident, cultivated: new_user.cultivated,
            reliable: new_user.reliable, spiritual: new_user.spiritual,
            imaginative: new_user.imaginative, sophisticated: new_user.sophisticated,
            being_blinded: new_user.being_blinded, willing_experiment: new_user.willing_experiment,
            costume: new_user.costume, role_playing: new_user.role_playing,
            using_sex_toys: new_user.using_sex_toys, unusual_places: new_user.unusual_places,
            being_watched: new_user.being_watched, aerobics: new_user.aerobics, golf: new_user.golf,
---
INSERT INTO "temporary_lists" ("created_at", "updated_at", "gender", "country", "arts", "cooking", "networking", "video_games", "book", "dining_out", "movies", "nightclubs", "religion", "museum", "shopping", "wine", "coffee", "gardening", "pets", "golf", "soccer", "walking", "swimming", "baseball", "cycling", "basketball", "skiing", "volleyball", "being_blinded", "willing_experiment", "unusual_places", "independent", "mature", "outgoing", "self_confident", "imaginative", "username", "city", "description", "age", "marital_status", "anything_exciting", "open_anything", "undecided", "virtual", "height", "hair_color", "eye_color", "smoker", "active", "sociable", "generous", "relaxed", "modest", "sensitive", "photos", "ethnicity", "figure") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58) RETURNING "id"

        random_users.shift
      }
    }
    render json: TemporaryList.all
    TemporaryList.destroy_all
---
SELECT "temporary_lists".* FROM "temporary_lists"
DELETE FROM "temporary_lists" WHERE "temporary_lists"."id" = $1  [["id", 1]]